SSierraAl/STM32N6_Discovery_Camera_ToF_SD/x-cube-n6-camera-capture-main/nucleo/x-cube-n6-camera-capture-main/Src/app_cam.c
/**
 * ******************************************************************************
 * @file    app_cam.c
 * @author  GPM Application Team
 *
 * ******************************************************************************
 * @attention
 *
 * Copyright (c) 2023 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 * ******************************************************************************
 */
#include <stdint.h>
#include <string.h>
#include <assert.h>
#include "cmsis_compiler.h"
#include "cmw_camera.h"
#include "cmw_io.h"
#include "app_cam.h"
#include "app_config.h"
#include "perf_debug.h"
#include "debug_color.h"
#include "stm32n6xx.h"
#include "stm32n6xx_hal.h"
#include "utils.h"
#include "FreeRTOS.h"
#include "task.h"

/* IMX335 I2C address and standby/streaming registers */
#ifndef CAMERA_IMX335_ADDRESS
#define CAMERA_IMX335_ADDRESS  0x34U
#endif
#define IMX335_REG_MODE_SELECT  0x3000U
#define IMX335_MODE_STREAMING   0x00
#define IMX335_MODE_STANDBY     0x01

/** Helper: Write a single byte to an IMX335 register via I2C1 (16-bit addr). */
static int CAM_WriteSensorReg(uint16_t reg, uint8_t value)
{
  return CMW_I2C_WRITEREG16(CAMERA_IMX335_ADDRESS, reg, &value, 1);
}

extern PerfTimer_t g_perf_timer;
extern uint8_t capture_buf[];

#if CAMERA_SELFY == 1
#define SENSOR_IMX335_FLIP CMW_MIRRORFLIP_MIRROR
#define SENSOR_VD66GY_FLIP CMW_MIRRORFLIP_FLIP
#define SENSOR_VD55G1_FLIP CMW_MIRRORFLIP_FLIP
#define SENSOR_VD1943_FLIP CMW_MIRRORFLIP_MIRROR
#else
#define SENSOR_IMX335_FLIP CMW_MIRRORFLIP_NONE
#define SENSOR_VD66GY_FLIP CMW_MIRRORFLIP_FLIP_MIRROR
#define SENSOR_VD55G1_FLIP CMW_MIRRORFLIP_FLIP_MIRROR
#define SENSOR_VD1943_FLIP CMW_MIRRORFLIP_NONE
#endif

#define SENSOR_WIDTH     0
#define SENSOR_HEIGHT    0

static const char *sensor_names[] = {
  "CMW_UNKNOWN", "CMW_VD66GY", "CMW_IMX335", "CMW_VD55G1", "CMW_VD1943",
};
static CMW_Sensor_Name_t sensor;
static int is_sensor_valid = 0;
static int g_cam_ready = 0;
/* Separate ready flag for CALLBACK-BATCH mode (CAPTURE_MODE = 4). */
static int g_callback_ready = 0;

static int CAM_getFlipMode(CMW_Sensor_Name_t s)
{
  int mode = CMW_MIRRORFLIP_NONE;
  int idx = 0;
  switch (s) {
    case CMW_VD66GY_Sensor:    mode = SENSOR_VD66GY_FLIP; idx = 1; break;
    case CMW_IMX335_Sensor:    mode = SENSOR_IMX335_FLIP; idx = 2; break;
    case CMW_VD55G1_Sensor:    mode = SENSOR_VD55G1_FLIP; idx = 3; break;
    case CMW_VD1943_Sensor:    mode = SENSOR_VD1943_FLIP; idx = 4; break;
    default: assert(0);
  }
  printf("Detected %s\n", sensor_names[idx]);
  return mode;
}

static int CAM_FormatToBpp(int fmt)
{
  switch (fmt) {
    case DCMIPP_PIXEL_PACKER_FORMAT_MONO_Y8_G8_1: return 1;
    case DCMIPP_PIXEL_PACKER_FORMAT_RGB565_1:
    case DCMIPP_PIXEL_PACKER_FORMAT_YUV422_1: return 2;
    case DCMIPP_PIXEL_PACKER_FORMAT_RGB888_YUV444_1: return 3;
    default: assert(0); return 0;
  }
}

static void CAM_InitCropConfig(CMW_Manual_roi_area_t *roi, int sw, int sh, CAM_conf_t *conf)
{
  float rx = (float)sw / conf->capture_width;
  float ry = (float)sh / conf->capture_height;
  float r = MIN(rx, ry);
  assert(r >= 1 && r < 64);
  roi->width  = (uint32_t)MIN(conf->capture_width * r, sw);
  roi->height = (uint32_t)MIN(conf->capture_height * r, sh);
  roi->offset_x = (sw - roi->width + 1) / 2;
  roi->offset_y = (sh - roi->height + 1) / 2;
}

static void CAM_EnableYuv(uint32_t Pipe)
{
  DCMIPP_ColorConversionConfTypeDef cc = {
    .ClampOutputSamples = ENABLE, .OutputSamplesType = DCMIPP_CLAMP_YUV,
    .RR = 131, .RG = -119, .RB = -12, .RA = 128,
    .GR = 55, .GG = 183, .GB = 18, .GA = 0,
    .BR = -30, .BG = -101, .BB = 131, .BA = 128,
  };
  assert(Pipe == DCMIPP_PIPE1);
  assert(HAL_DCMIPP_PIPE_SetYUVConversionConfig(CMW_CAMERA_GetDCMIPPHandle(), Pipe, &cc) == HAL_OK);
  assert(HAL_DCMIPP_PIPE_EnableYUVConversion(CMW_CAMERA_GetDCMIPPHandle(), Pipe) == HAL_OK);
}

static void DCMIPP_PipeInitCapture(CAM_conf_t *cam_conf, int sw, int sh, CAM_conf_t *conf)
{
  CMW_DCMIPP_Conf_t dc;
  uint32_t hw_pitch;
  assert(conf->capture_width >= conf->capture_height);
  dc.output_width  = conf->capture_width;
  dc.output_height = conf->capture_height;
  dc.output_format = cam_conf->dcmipp_output_format;
  dc.output_bpp    = CAM_FormatToBpp(cam_conf->dcmipp_output_format);
  dc.mode          = CMW_Aspect_ratio_manual_roi;
  dc.enable_swap   = cam_conf->is_rgb_swap;
  dc.enable_gamma_conversion = 0;
  CAM_InitCropConfig(&dc.manual_conf, sw, sh, conf);
  assert(CMW_CAMERA_SetPipeConfig(DCMIPP_PIPE1, &dc, &hw_pitch) == HAL_OK);
  assert(hw_pitch == dc.output_width * dc.output_bpp);
  if (cam_conf->dcmipp_output_format == DCMIPP_PIXEL_PACKER_FORMAT_YUV422_1)
    CAM_EnableYuv(DCMIPP_PIPE1);
}

int CAM_Init(CAM_conf_t *conf)
{
  CMW_CameraInit_t cam_conf;
  int ret;

  /* Camera I2C can become corrupted if the board was power-cycled or the
     program was interrupted while the camera was active. Retry up to 3 times
     with I2C bus reset between attempts instead of asserting. */
  if (!is_sensor_valid) {
    is_sensor_valid = 1;
    for (int attempt = 1; attempt <= 3; attempt++) {
      ret = CMW_CAMERA_GetSensorName(&sensor);
      if (ret == CMW_ERROR_NONE) break;
      printf("[CAM] I2C not ready (attempt %d/3, ret=%d)\n", attempt, ret);
      vTaskDelay(pdMS_TO_TICKS(200));
    }
    if (ret != CMW_ERROR_NONE) {
      printf("[CAM] FATAL: Cannot detect sensor after 3 retries (ret=%d)\n", ret);
      assert(0);
    }
  }

  cam_conf.width = SENSOR_WIDTH;
  cam_conf.height = SENSOR_HEIGHT;
  cam_conf.fps = conf->fps;
  cam_conf.mirror_flip = CAM_getFlipMode(sensor);
  ret = CMW_CAMERA_Init(&cam_conf, NULL);
  if (ret != CMW_ERROR_NONE) {
    printf("[CAM] Init failed (ret=%d), retrying with delay...\n", ret);
    vTaskDelay(pdMS_TO_TICKS(500));
    ret = CMW_CAMERA_Init(&cam_conf, NULL);
  }
  if (ret != CMW_ERROR_NONE) {
    printf("[CAM] FATAL: Init failed after retry (ret=%d)\n", ret);
    assert(0);
  }
  assert(cam_conf.width && cam_conf.height);
  DCMIPP_PipeInitCapture(conf, cam_conf.width, cam_conf.height, conf);
  return ret;
}

