SSierraAl/STM32N6_Discovery_Camera_ToF_SD/x-cube-n6-camera-capture-main/nucleo/x-cube-n6-camera-capture-main/Src/app_cam.c
  DCMIPP_HandleTypeDef *h = CMW_CAMERA_GetDCMIPPHandle();
  CAM_CapturePipe_Start(capture_buf, CMW_MODE_CONTINUOUS);
  CMW_CAMERA_SetExposure(CAM_EXPOSURE_VALUE);
  CMW_CAMERA_SetGain(CAM_GAIN_VALUE);
  CAM_IspUpdate();

#if PERF_DEBUG_LEVEL >= 1
  printf("[CAM] Warmup %d frames...\n", SNAP_WARMUP_FRAMES);
#endif
  CAM_ResetFrameCounter(SNAP_WARMUP_FRAMES);
  uint32_t t0 = HAL_GetTick();
  while (g_wait_frames != 0) {
    CAM_IspUpdate();
    vTaskDelay(pdMS_TO_TICKS(5));
    if (HAL_GetTick() - t0 > 5000) { HAL_DCMIPP_CSI_PIPE_Stop(h, DCMIPP_PIPE1, DCMIPP_VIRTUAL_CHANNEL0); CAM_Deinit(); return -1; }
  }

  int captured = 0;
  for (int i = 0; i < frame_count; i++) {
    CAM_ResetFrameCounter(1);
    t0 = HAL_GetTick();
    while (g_wait_frames != 0) {
      CAM_IspUpdate();
      vTaskDelay(pdMS_TO_TICKS(5));
      if (HAL_GetTick() - t0 > 500) break;
    }
    uint8_t *dest = batch_buf + (i * frame_size);
    SCB_InvalidateDCache_by_Addr((uint32_t*)capture_buf, frame_size);
    memcpy(dest, capture_buf, frame_size);
    SCB_CleanDCache_by_Addr((uint32_t*)dest, frame_size);
    captured++;
  }
  HAL_DCMIPP_CSI_PIPE_Stop(h, DCMIPP_PIPE1, DCMIPP_VIRTUAL_CHANNEL0);
  CAM_Deinit();
#if PERF_DEBUG_LEVEL >= 1
  printf("[CAM] Batch: %d/%d in %lu ms\n", captured, frame_count, (unsigned long)(HAL_GetTick()-t0));
#endif
  return captured;
}

/* ================================================================
   CONTINUOUS MODE INTERNAL HELPER
   ================================================================ */
static int CAM_InitAndStartContinuous(uint8_t *buf, int buf_size, int width, int height, int fps, int warmup_frames)
{
  int min_size = width * height * 2;
  if (!buf || buf_size <= 0 || buf_size < min_size) return -1;
  if (warmup_frames < 0) warmup_frames = 0;

#if PERF_DEBUG_LEVEL >= 1
  printf("[CAM] Init %dx%d@%d YUV422...\n", width, height, fps);
#endif
  CAM_conf_t conf = {0};
  conf.capture_width = width;
  conf.capture_height = height;
  conf.fps = fps;
  conf.dcmipp_output_format = DCMIPP_PIXEL_PACKER_FORMAT_YUV422_1;
  conf.is_rgb_swap = 0;
  CAM_Init(&conf);

  CMW_CAMERA_SetExposureMode(CAM_EXPOSURE_MODE == 1 ? CMW_EXPOSUREMODE_MANUAL :
                             CAM_EXPOSURE_MODE == 2 ? CMW_EXPOSUREMODE_AUTOFREEZE : CMW_EXPOSUREMODE_AUTO);
  if (CAM_EXPOSURE_MODE == 1) {
    CMW_CAMERA_SetExposure(CAM_EXPOSURE_VALUE);
    CMW_CAMERA_SetGain(CAM_GAIN_VALUE);
#if PERF_DEBUG_LEVEL >= 2
    int32_t re, rg; CMW_CAMERA_GetExposure(&re); CMW_CAMERA_GetGain(&rg);
    printf("[CAM] exposure=%ld gain=%ld\n", (long)re, (long)rg);
#endif
  }

  DCMIPP_HandleTypeDef *h = CMW_CAMERA_GetDCMIPPHandle();
#if PERF_DEBUG_LEVEL >= 1
  printf("[CAM] Start continuous...\n");
#endif
  CAM_CapturePipe_Start(buf, CMW_MODE_CONTINUOUS);

  if (CAM_EXPOSURE_MODE == 1) {
    CMW_CAMERA_SetExposure(CAM_EXPOSURE_VALUE);
    CMW_CAMERA_SetGain(CAM_GAIN_VALUE);
    CAM_IspUpdate();
#if PERF_DEBUG_LEVEL >= 1
    int32_t re, rg; CMW_CAMERA_GetExposure(&re); CMW_CAMERA_GetGain(&rg);
    printf("[CAM] Post-start exp=%ld gain=%ld\n", (long)re, (long)rg);
#endif
  }

  if (warmup_frames > 0) {
#if PERF_DEBUG_LEVEL >= 1
    printf("[CAM] Warmup %d frames...\n", warmup_frames);
#endif
    CAM_ResetFrameCounter(warmup_frames);
    uint32_t t0 = HAL_GetTick();
    while (g_wait_frames != 0) {
      CAM_IspUpdate();
      vTaskDelay(pdMS_TO_TICKS(5));
      if (HAL_GetTick() - t0 > 5000) {
        HAL_DCMIPP_CSI_PIPE_Stop(h, DCMIPP_PIPE1, DCMIPP_VIRTUAL_CHANNEL0); CAM_Deinit(); return -1;
      }
    }
#if PERF_DEBUG_LEVEL >= 1
    printf("[CAM] Warmup done (%lu frames). RUNNING.\n", (unsigned long)g_frame_count);
#endif
  }
  return 0;
}

int CAM_ContinuousStart(uint8_t *buf, int bs, int w, int h, int fps)
{
  return CAM_InitAndStartContinuous(buf, bs, w, h, fps, SNAP_WARMUP_FRAMES);
}

int CAM_ContinuousSnap(uint8_t *dest, uint32_t fs)
{
  if (!dest) return -1;
  uint32_t t0 = HAL_GetTick();
  DCMIPP_HandleTypeDef *h = CMW_CAMERA_GetDCMIPPHandle();
  HAL_DCMIPP_CSI_PIPE_Stop(h, DCMIPP_PIPE1, DCMIPP_VIRTUAL_CHANNEL0);
  for (volatile int i = 0; i < 100; i++);
  SCB_InvalidateDCache_by_Addr((uint32_t*)capture_buf, fs);
  memcpy(dest, capture_buf, fs);
  SCB_CleanDCache_by_Addr((uint32_t*)dest, fs);
  CAM_CapturePipe_Start(capture_buf, CMW_MODE_CONTINUOUS);
#if PERF_DEBUG_LEVEL >= 1
  printf("[CAM] ContinuousSnap in %lu ms\n", (unsigned long)(HAL_GetTick()-t0));
#endif
  return 0;
}

int CAM_ContinuousStop(void)
{
  DCMIPP_HandleTypeDef *h = CMW_CAMERA_GetDCMIPPHandle();
  if (h) HAL_DCMIPP_CSI_PIPE_Stop(h, DCMIPP_PIPE1, DCMIPP_VIRTUAL_CHANNEL0);
  CAM_Deinit();
  return 0;
}

/* ================================================================
   BATCH MODE (CAPTURE_MODE = 2)
   ================================================================ */
int CAM_ContinuousBatchSnap(uint8_t *batch_buf, uint32_t frame_size)
{
#if CAPTURE_MODE != 2
  (void)batch_buf; (void)frame_size; return -1;
#endif
  if (!batch_buf) return -1;
  DCMIPP_HandleTypeDef *h = CMW_CAMERA_GetDCMIPPHandle();
  if (!h) return -1;

  uint32_t t0 = HAL_GetTick();
  uint8_t captured = 0;
#if PERF_DEBUG_LEVEL >= 1
  printf("[CAM] BatchSnap: %d frames...\n", BATCH_FRAMES);
#endif

  for (uint8_t i = 0; i < BATCH_FRAMES; i++) {
    uint8_t *dest = batch_buf + (i * frame_size);
    HAL_DCMIPP_CSI_PIPE_Stop(h, DCMIPP_PIPE1, DCMIPP_VIRTUAL_CHANNEL0);
    for (volatile int d = 0; d < 100; d++);
    SCB_InvalidateDCache_by_Addr((uint32_t*)capture_buf, frame_size);
    memcpy(dest, capture_buf, frame_size);
    SCB_CleanDCache_by_Addr((uint32_t*)dest, frame_size);
    CAM_CapturePipe_Start(capture_buf, CMW_MODE_CONTINUOUS);
    captured++;
    if (i < BATCH_FRAMES - 1) {
      CAM_ResetFrameCounter(1);
      uint32_t tw = HAL_GetTick();
      while (g_wait_frames != 0) {
        CAM_IspUpdate();
        vTaskDelay(pdMS_TO_TICKS(2));
        if (HAL_GetTick() - tw > 200) break;
      }
    }
  }

  uint32_t elapsed = HAL_GetTick() - t0;
#if PERF_DEBUG_LEVEL >= 1
  printf("[CAM] BatchSnap: %d frames in %lu ms\n", (unsigned long)captured, (unsigned long)elapsed);
#endif
  return (int)captured;
}

/* ================================================================
   CALLBACK-BATCH MODE (CAPTURE_MODE = 4)
   Callback-driven continuous batch capture — NO Stop/Restart between frames.

